# Задача 1
# Есть список a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89].

# Выведите все элементы, которые меньше 5.

a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
print("Task 1")
print([i for i in a if i < 5])

# Задача 2
# Даны списки:

# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];

# b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13].

# Нужно вернуть список, который состоит из элементов, общих для этих двух списков.

a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
c = []
for i, j in zip(a, b):
    if i in b:
        c.append(i)
    elif j in a:
        c.append(j)
    t = set(c)
print("Task 2")
print([ i for i in t])
result = list(set(a) & set(b))
print(result)

# Задача 3

# Отсортируйте словарь по значению в порядке возрастания и убывания.

d = {1: 2, 3: 4, 4: 3, 2: 1, 0: 0}
sorted_tuple = sorted(d.items(), key=   lambda x: x[0])

print("Task 3")
print(dict(sorted_tuple))
